Duplicate Data handling

In [1]:
import pandas as pd

In [4]:
data = {"name": ["a", "b", "c", "d", "c", "a"], "eng":[8,7,6,9,6,4], "hindi":[2,3,4,5,4,2]}

In [5]:
df = pd.DataFrame(data)
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    6      4
3    d    9      5
4    c    6      4
5    a    4      2

In [6]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [7]:
df["dup"] = df.duplicated()
df

  name  eng  hindi    dup
0    a    8      2  False
1    b    7      3  False
2    c    6      4  False
3    d    9      5  False
4    c    6      4   True
5    a    4      2  False

In [19]:
df = df.drop(columns='dup')

In [20]:
df.drop_duplicates(inplace=True)

In [21]:
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    6      4
3    d    9      5
5    a    4      2

In [22]:
df = pd.read_csv("loan.csv")
df.head()

,loan_amnt,term,int_rate,emp_length,home_ownership,annual_inc,purpose,addr_state,dti,delinq_2yrs,revol_util,total_acc,bad_loan,longest_credit_length,verification_status
0,5000,36 months,10.65,10.0,RENT,24000.0,credit_card,AZ,27.65,0.0,83.7,9.0,0,26.0,verified
1,2500,60 months,15.27,0.0,RENT,30000.0,car,GA,1.00,0.0,9.4,4.0,1,12.0,verified
2,2400,36 months,15.96,10.0,RENT,12252.0,small_business,IL,8.72,0.0,98.5,10.0,0,10.0,not verified
3,10000,36 months,13.49,10.0,RENT,49200.0,other,CA,20.00,0.0,21.0,37.0,0,15.0,verified
4,5000,36 months,7.90,3.0,RENT,36000.0,wedding,AZ,11.20,0.0,28.3,12.0,0,7.0,verified

In [23]:
df.duplicated()

0         False
1         False
2         False
3         False
4         False
          ...
163982    False
163983    False
163984    False
163985    False
163986    False
Length: 163987, dtype: bool

In [25]:
df.shape

(163987, 15)

In [26]:
df.drop_duplicates().shape

(163987, 15)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 163987 entries, 0 to 163986
Data columns (total 15 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   loan_amnt              163987 non-null  int64
 1   term                   163987 non-null  object
 2   int_rate               163987 non-null  float64
 3   emp_length             158183 non-null  float64
 4   home_ownership         163987 non-null  object
 5   annual_inc             163983 non-null  float64
 6   purpose                163987 non-null  object
 7   addr_state             163987 non-null  object
 8   dti                    163987 non-null  float64
 9   delinq_2yrs            163958 non-null  float64
 10  revol_util             163794 non-null  float64
 11  total_acc              163958 non-null  float64
 12  bad_loan               163987 non-null  int64
 13  longest_credit_length  163958 non-null  float64
 14  verification_status    163987 non-null  object
dtypes: float64(8), int64(2), object(5)
memory usage: 18.8+ MB

In [28]:
df["bad_loan"].value_counts()

bad_loan
0    133971
1     30016
Name: count, dtype: int64